
// Исправленно/реализованно:------------------------------------------------------------------------------------------------------------------------------------------------------------------ ✓

// Созданна иконка для игры

// Исправить/реализовать:---------------------------------------------------------------------------------------------------------------------------------------------------------------------

// --------------------------------------------------------------------------------------- Идеи в случае продолжения работы над проектом ----------------------------------------------------------------------

// В меню игры, в процессе самой игры сделать возможным переворот экрана, однако в других окнах его заблокировать. (Если такое вообще возможно)

// Сделать чтобы после нажатии кнопки в главное меню не сбрасывались все настройки игры, имя игроков количество игроков и их фигурки.

// Не сбрасывать номер выбранной карты если вышел из меню выбора карты только для того чтобы поменять 2ого игрока на компьютера по требованию игры.

// Сделать систему удаления законченных линий с клетками тумана

// Как выключающаяся опция с предупреждением что она немного дополнительно нагружает систему. Во время черчения циферки рядом с прицелом считающие сколько клеток ты прошёл в одном направлении. Помогает чертить.

// Сделать чтобы при черчении 1 линии минимальная длинна была в 9 клеток а при черчении второй и последующих минимальная длинна была в 4 клетки чтобы внутренние полости могли быть размером с одну клетку

// На маленьком планшете пару линий прыгают не смотря на включеннную постобработку.

// Чтобы улучшить производительность можно вместо кучи материалов для каждой фигурки сделать один материал но с текстурами и братся текстуры будут с одной большой текстуры (атласная текстура)

// Р(Редкий баг)Если удалить последнюю карту, выдти из игры а потом запустить игру игра выдаёт ошибку.

// Р(редкий баг) Если удалять и создавать карты то в конце концов при очередном старте игры произойдёт ошибка. Выяснить что не так с сохранением созданных карт

// На моём старом планшете не видно клеток "тетрадки"

// Ввести кнопку настройки качества

// * Дополнить систему уменьшения и увеличения, а именно как сейчас по нажатии кнопки увеличения блокируется установка фигурок а в дополнении к + и - сделать увеличение двумя пальцами.

// * Сделать чтобы в режиме увеличения и уменьшения так же можно было двигать экран пальцами вверх и вниз, влево и вправо 

// * Когда будет реализованна функция увеличения и движения экрана пальцами в режиме увеличения, сделать кнопку слева вверху которая будет появлятся в режиме увеличения. И будет заставлять исчезнуть и появится
// стандартные элементы управления (увеличения экрана). А так же выбранный вкл/выкл этой кнопки должен сохранятся в сохранении игры.

// ----------------------------------------------------------------------------------------- Неотлавливаемые баги ------------------------------------------------------------------------------------------
using UnityEngine;
public class Notes : MonoBehaviour
{}
